## SQl - CTE [ Common Table Expression ]
    A CTE [ Common Table Expression ] is a temporary named result set that you define inside a SQL query using the WITH keyword. It exists only for the duration of that query.\
    -> A CTE is ::
     - A temporary view
     - Or a subquery with a name
     - Or a way to write complex queries in readable steps

    -> Basic Syntax of CTE ::
        WITH cte_name AS (
            SELECT column1, column2
            FROM table_name
            WHERE condition
        )
        SELECT *
        FROM cte_name;

     - WITH starts the CTE
     - cte_name is the temporary table name
     - The query inside parentheses defines the data
     - The main query uses the CTE like a normal table

### Database Connection

In [10]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:@localhost/test

In [12]:
%%sql
SELECT version();

 * mysql+pymysql://root:***@localhost/test
1 rows affected.

[('10.4.32-MariaDB',)]

### Using Already Created table employees

In [15]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost/test
7 rows affected.

[(101, 'Amit', 'IT', 60000, 25, 'Pune', datetime.date(2022, 6, 10)),
 (102, 'Neha', 'HR', 45000, 28, 'Mumbai', datetime.date(2021, 3, 15)),
 (103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (104, 'Sneha', 'Finance', 50000, 26, 'Delhi', datetime.date(2022, 11, 5)),
 (105, 'Vikas', 'HR', 40000, 35, 'Mumbai', datetime.date(2019, 8, 12)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Show employees whose salary is above company average.

#### Without CTE

In [27]:
%%sql
select * from employees
where salary >(
    select avg(salary) from employees
);

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

#### With CTE

In [33]:
%%sql
with avg_salary as(
    select avg(salary) as avg_sal 
    from employees
)
select * from employees
where salary > (select avg_sal from avg_salary)

 * mysql+pymysql://root:***@localhost/test
3 rows affected.

[(103, 'Rahul', 'IT', 75000, 30, 'Pune', datetime.date(2020, 1, 20)),
 (106, 'Priya', 'IT', 85000, 29, 'Bangalore', datetime.date(2018, 4, 25)),
 (107, 'Arjun', 'Finance', 65000, 32, 'Pune', datetime.date(2020, 9, 18))]

### Find employees whose salary is above department average.

In [42]:
%%sql
with avg_dep_salary_filt as(
    select emp_name, department, salary,
    avg(salary) over(partition by department) as avg_dep_salary
    from employees)
select * from avg_dep_salary_filt
where salary > avg_dep_salary;

 * mysql+pymysql://root:***@localhost/test
4 rows affected.

[('Arjun', 'Finance', 65000, Decimal('57500.0000')),
 ('Neha', 'HR', 45000, Decimal('42500.0000')),
 ('Rahul', 'IT', 75000, Decimal('73333.3333')),
 ('Priya', 'IT', 85000, Decimal('73333.3333'))]

### Find top 2 highest-paid employees per department using:

In [111]:
%%sql
with high_paid as(
    select emp_name, salary, department,
    rank() over(partition by department order by salary desc) as rank_emp
    from employees)
select * from high_paid
where rank_emp <= 2;

 * mysql+pymysql://root:***@localhost/test
6 rows affected.

[('Arjun', 65000, 'Finance', 1),
 ('Sneha', 50000, 'Finance', 2),
 ('Neha', 45000, 'HR', 1),
 ('Vikas', 40000, 'HR', 2),
 ('Priya', 85000, 'IT', 1),
 ('Rahul', 75000, 'IT', 2)]

### Calculate department-wise total salary -> Then return only departments where total salary > 1,000,000

In [101]:
%%sql
with dep_total_sal as (
    select department, sum(salary) as sum_salary
    from employees
    group by department)
select * from dep_total_sal
where sum_salary > 100000;

 * mysql+pymysql://root:***@localhost/test
2 rows affected.

[('Finance', Decimal('115000')), ('IT', Decimal('220000'))]